const responses = {
    "miss you": "অরেক বেডারে Miss না করে xan মেয়ে হলে বস Mahabub রে হাঙ্গা করো😶👻😘",
    "help": "Prefix de sala",
    "hi": "এত হাই-হ্যালো কর ক্যান প্রিও..!😜🫵",
    "good morning": "GOOD MORNING দাত ব্রাশ করে খেয়ে নেও😚",
    "tor ball": "~ এখনো বাল উঠে নাই নাকি তোমার?? 🤖",
    "owner": "‎[𝐎𝐖𝐍𝐄𝐑:☞ Mahabub☜\nFacebook: https://www.facebook.com/www.xnxx.com140",
 
    "assalamualaikum": "وَعَلَيْكُمُ السَّلَامُ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ 💖",
    "kiss me": "তুমি পঁচা তোমাকে কিস দিবো না 🤭",
    "thanks": "এতো ধন্যবাদ না দিয়ে আমার বস Mahabub রে তোর গার্লফ্রেন্ড টা দিয়ে দে..!🐸🥵",
   
    "ami Mahabub": "হ্যা বস কেমন আছেন..?☺️",
    "bot er baccha": "আমার বাচ্চা তো তোমার গার্লফ্রেন্ডের পেটে..!!🌚⛏️",
    "tor nam ki": "MY NAME IS 「𝐌𝐀𝐇𝐀𝐁𝐔𝐁-𝐁𝐎𝐓 」🩷🪽",
    "pic de": "এন থেকে সর দুরে গিয়া মর😒",
    "bal": "রাগ করে না সোনা পাখি 🥰",
    "heda": "এতো রাগ শরীরের জন্য ভালো না 🥰",
    "boda": "ভাই তুই এত হাসিস না..!🌚🤣",
    "kire ki koros": "তোমার কথা ভাবতে ছি জানু",
    "kire bot": "হ্যাঁ সব কেমন আছেন আপনার ওই খানে উম্মাহ 😘😽🙈"
};

module.exports.config = {
  name: "anop", 
  version: "1.0.0",
  permission: 0,
  credits: " Imran",
  description: "Noprefix auto reply system",
  prefix: false, 
  category: "fun", 
  usages: "just type message", 
  cooldowns: 0
};

module.exports.handleEvent = async ({ api, event }) => {
  const text = event.body ? event.body.toLowerCase() : "";
  if (responses[text]) {
    return api.sendMessage(responses[text], event.threadID, event.messageID);
  }
};

module.exports.run = async () => {
  // not used because it's noprefix
};
